import { Component } from '@angular/core';
import { CommonModule } from '@angular/common';


@Component({
  selector: 'app-news',
  standalone: true,
  imports: [CommonModule],
  templateUrl: './news.html',
  styleUrls: ['./news.scss']
})
export class News {
  newsList = [
    {
      title: 'المهندس لؤي المشعبي يقدم استقالته عن رئاسة نادي الاتحاد في الشركة الغير ربحية',
      content: ' قدم المهندس لؤي مشعبي استقالته اليوم بسبب انشغاله في امور حياته الخاصة وخصص المهندس في خطابه الاخير الشكر والتقدير لجمهور الاتحاد عامة على دعمهم له ولي فريقهم وانه امر غير مستغرب عليهم مع تمنياته بالتوفيق للفريق والجمهور مستقبلا.' ,
      date: 'العام الماضي',
      image: 'assets/news1.jpg'
    },
    {
      title: 'دفع مبلغ العضوية الماسية من المهندس عمر سندي',
      content: ' بتاريخ 2023/10/01 قام المهندس عمر سندي بدفع مبلغ العضوية الماسية لنادي الاتحاد السعودي بمبلغ 1000000 ريال سعودي، حيث تم استلام المبلغ من قبل النادي وتم اصدار شهادة العضوية الماسية له.',
      date: 'العام الماضي',
      image: 'assets/news2.jpeg'
    },
    {
      title: 'الاتحاد بطل الثنائية الحارقة',
      content: ' حقق نادي الاتحاد السعودي إنجازًا تاريخيًا بفوزه بلقب الدوري السعودي للمحترفين وكأس خادم الحرمين الشريفين في نفس الموسم، حقق الاتحاد البطولتين رغم الظروف والتحديات التي واجهها الفريق خلال الموسم، حيث أظهر اللاعبون والجهاز الفني روحًا قتالية عالية وإصرارًا على تحقيق النجاح.',
      date: 'العام الماضي',
      image: 'assets/new3.jpg'
    },
    {
      title: 'في يوم التأسيس خسر الخسيس',
      content: 'انتصر الاتحاد اليوم على نادي الهلال باربعة اهداف مقابل هدف سجل الهدف الاول حسن كادش والهدف الثاني بريجوين والهدف الثالث بيرجوين والهدف الاخير الاسطورة كريم بنزيما',
      date: 'العام الماضي',
      image: 'assets/new4.jpeg'
    }
  ];
}
